wisteria-1c/Конфигурация/InformationRegisters/НДФЛИмущественныйВычет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НДФЛИмущественныйВычет</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Применяется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыПоКредиту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/НДФЛИмущественныйВычет/Forms/ФормаЗаполненияИмущественныхВычетов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗапись();
	Элементы.ГруппаДанныеВычета.Доступность = запись.Применяется;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименяетсяПриИзменении(Элемент)
	
	Элементы.ГруппаДанныеВычета.Доступность = запись.Применяется;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьЗапись();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьЗапись();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗапись()
	
	ЗапросПоИмущественномуВычету = Новый Запрос;
	ЗапросПоИмущественномуВычету.Текст =
	"ВЫБРАТЬ
	|	НДФЛИмущественныйВычетСрезПоследних.Период КАК Период,
	|	НДФЛИмущественныйВычетСрезПоследних.Сотрудник КАК Сотрудник,
	|	НДФЛИмущественныйВычетСрезПоследних.Применяется КАК Применяется,
	|	НДФЛИмущественныйВычетСрезПоследних.СуммаРасходов КАК СуммаРасходов,
	|	НДФЛИмущественныйВычетСрезПоследних.ПроцентыПоКредиту КАК ПроцентыПоКредиту,
	|	НДФЛИмущественныйВычетСрезПоследних.КодИФНС КАК КодИФНС,
	|	НДФЛИмущественныйВычетСрезПоследних.НомерУведомления КАК НомерУведомления,
	|	НДФЛИмущественныйВычетСрезПоследних.ДатаУведомления КАК ДатаУведомления,
	|	НДФЛИмущественныйВычетСрезПоследних.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.НДФЛИмущественныйВычет.СрезПоследних КАК НДФЛИмущественныйВычетСрезПоследних
	|ГДЕ
	|	НДФЛИмущественныйВычетСрезПоследних.Сотрудник = &Сотрудник";
	ЗапросПоИмущественномуВычету.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	Выборка = ЗапросПоИмущественномуВычету.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Иначе
		Запись.Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

// Процедура сохраняет запись в регистр сведений ДокументыФизическихЛиц
&НаСервере
Процедура СохранитьЗапись()
	
	МенеджерЗаписи = РегистрыСведений.НДФЛИмущественныйВычет.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
	МенеджерЗаписи.Записать();
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти
